import 'package:flutter/material.dart';

// void main() => runApp(Province());

class Travel extends StatelessWidget {
  final List myImageData = [
    'travel/Gyeongbokgung.jpg',
    'travel/Nami.jpg',
    'travel/sakura2.jpg',
    'travel/sakura3.jpg',
    'travel/jeju.jpg',
    'travel/seoul tower.jpg',
    'travel/Bukchon.jpg',
  ];
  final List nameThai = [
    'พระราชวังเคียงบกเกียง',
    'เกาะนามิ',
    'ทางรถไฟดอกซากุระคยองฮวา',
    'อุโมงค์ซากุระ คลองยอชวาชอน',
    'เกาะเชจู',
    'โซลทาวเวอร์',
    'หมู่บ้านบุกชอนฮันอก',
  ];
  final List detail = [
    '่พระราชวังเคียงบกกุง (Gyeongbokgung Palace) หรือเรียกอีกแบบหนึ่งว่า “พระราชวังคยองบกกุง” เป็นทั้งสัญญลักษณ์และแหล่งท่องเที่ยวยอดฮิตของกรุงโซล rพระราชวังที่มีขนาดใหญ่และเก่าแก่ที่สุดในกรุงโซล สร้างขึ้นในปี 1394 ในสมัยพระเจ้าแทโจ ราชวงศ์โชซอน เดิมทีนั้นภายในพระราชวังมีอาคารและตำหนักต่างๆมากกว่า 200 หลัง แต่เมื่อมีการรุกรานของญี่ปุ่น อาคารส่วนใหญ่ก็ได้ถูกทำลายลงเหลืออยู่เพียงแค่ 10 หลังเท่านั้น อยู่ที่: โซล (Seoul)',
    'เกาะนามิ (Namiseom Island) หรือนามิโซม เป็นหนึ่งในจุดท่องเที่ยวหลักที่ห้ามพลาดของประเทศเกาหลี มีชื่อโด่งดังไปทั่วโลกจากซีรี่ย์ยอดฮิตเรื่อง winter sonata หรือชื่อไทยว่า เพลงรักในสายลมหนาว บนเกาะนี้มีชื่อเสียงในหมู่คนเกาหลีมานานเนื่องจากมีธรรมชาติที่สวยงาม โดยเฉพาะในช่วงฤดูใบไม้เปลี่ยนสี ทั่วทั้งเกาะใบไม้จะเปลี่ยนเป็นสีเหลืองทอง อยู่ที่: คังวอนโด(Gangwon-do)',
    'ทางรถไฟดอกซากุระคยองฮวา (Gyeonghwa Station) เป็นหนึ่งในจุดชมซากุระที่สวยอันดับต้นๆของเกาหลีเลยก็ว่าได้ โดยสามารถมองเห็นรถไฟที่วิ่งมาจอดที่สถานีพร้อมกับวิวอุโมงค์ดอกซากุระที่เรียงรายกันอยู่เต็มทั้งสองข้างทางในช่วงประมาณต้นเดือนเมษายน จึงทำให้ผู้คนนิยมมาท่องเที่ยวถ่ายภาพขณะที่รถไฟกำลังวิ่งผ่าน อยู่ที่ เคียงซังนัมโด (Gyeongsangnam-do)',
    'อุโมงค์ซากุระ คลองยอชวาชอน (Yeojwacheon Stream) คลองแห่งนี้เริ่มเป็นที่รู้จักกันหลังจากซีรีย์เรื่อง Romance ออกอากาศเมื่อปี 2002 ซึ่งใช้คลองแห่งนี้เป็นฉากในการถ่ายทำ ในทุกๆเดือนเมษายนของทุกปีซึ่งเป็นช่วงที่มีเทศกาลชมดอกซากุระ ที่คลองแห่งนี้จะเต็มไปด้วยนักท่องเที่ยวที่เดินทางมาชมความงามของดอกซากุระ สามารถเดินเล่นได้ทั้งด้านบนสะพานและด้านล่างซึ่งจะมีทางเท้ายาวตลอดแนวเรียบไปกับคลองน้ำได้ อยู่ที่ เคียงซังนัมโด (Gyeongsangnam-do)',
    'เกาะเชจู (Jeju) เป็นเกาะที่เกิดจากภูเขาไฟที่ใหญ่ที่สุดของเกาหลี อยู่ทางตอนใต้ของเกาหลีใต้ เนื่องจากมีธรรมชาติที่อุดมสมบูรณ์และสวยงามจึงได้ชื่อว่าเป็น ฮาวายของเกาหลี นักท่องเที่ยวนิยมเดินทางมากพักผ่อนเป็นจำนวนมากเนื่องจากมีทั้งหาดทราย, ทะเล, หน้าผา, ถ้ำ, น้ำตก ให้เที่ยวชม อยู่ที่: เกาะเชจู (Jeju)',
    'โซลทาวเวอร์ หรือ นัมซาน ทาวเวอร์ (N Seoul Tower) เป็นหนึ่งในแหล่งท่องเที่ยวสำคัญของเมืองโซล เปิดให้บริการมาตั้งแต่ปี 1980 ตั้งอยู่บนยอดเขานัมซัง สูง 236 เมตร ให้วิวเมืองโซลและบริเวณรอบๆแบบ พาโนราม่า นับว่าเป็นหนึ่งในทาวเวอร์ที่ให้วิวสวยที่สุดในเอเชีย จุดไฮไลท์ที่พลาดไม่ได้เลยเมื่อมาเที่ยว Seoul Tower นั่นก็คือ สถานที่คล้องกุญแจชื่อดัง  Love Key Ceremony ที่มีความเชื่อว่าคู่รักที่มาคล้องกุญแจที่จะมีความรักที่ยืนยาวไปตลอดกาล โดยที่จะเขียนข้อความหรือชื่อของคู่รักไว้บนแม่กุญแจ แล้วนำไปคล้องไว้กับราวเหล็กบริเวณฐานของ N Seoul Tower นั่นเอง อยู่ที่: โซล (Seoul)',
    'หมู่บ้านบุกชอนฮันอก (Bukchon Hanok Village) หรือบางคนเรียกว่า หมู่บ้านบุคชอนฮันอ๊ก เป็นอีกหนึ่งสัญลักษณ์ของเกาหลี ท่ามกลางตึกรามบ้านช่องที่ทันสมัยของกรุงโซลนั้น หมู่บ้านแห่งนี้ก็ยังคงรักษาอาคารบ้านเรือนในสมัยโบราณ มีกลิ่นอายของเกาหลีในยุคเก่าแก่ เหมาะสำหรับคนที่ชอบสถานที่ท่องเที่ยวเชิงประวัติศาสตร์ หมู่บ้านบุกชอนฮันอกถือเป็นสถานที่ท่องเที่ยวอีกแห่งหนึ่งที่เมื่อนักท่องเที่ยวได้ไปเยือนแล้ว จะได้พบกับบ้านของขุนนางระดับสูงของเกาหลีในสมัยก่อน ภายในหมู่บ้านมีอาคารแบบดั้งเดิมของเกาหลีกว่า 100 หลัง อยู่ที่: โซล (Seoul)',
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("สถานที่ท่องเที่ยว"),
      ),
      body: Center(
        child: GridView.builder(
          primary: false,
          padding: const EdgeInsets.all(20),
          itemCount: myImageData.length,
          // gridDelegate: new SliverGridDelegateWithFixedCrossAxisCount(crossAxisCount: (orientation == Orientation.portrait) ? 2 : 3),
          gridDelegate:
              new SliverGridDelegateWithFixedCrossAxisCount(crossAxisCount: 2),
          itemBuilder: (BuildContext context, int index) {
            return Column(
              children: <Widget>[
                GestureDetector(
                  child: Hero(
                    tag: myImageData[index],
                    child: Image.asset(
                      'assets/images/' + myImageData[index],
                      height: 100,
                      width: 100,
                    ),
                  ),
                  onTap: () {
                    Navigator.push(
                      context,
                      MaterialPageRoute(builder: (_) {
                        return DetailScreen(
                            myImageData[index], nameThai[index], detail[index]);
                      }),
                    );
                  },
                ),
                Text(nameThai[index]),
              ],
            );
          },
        ),
      ),
    );
  }
}




class Shopping extends StatelessWidget {
  final List myImageData = [
    "shopping/Myeongdong.jpg",
    "shopping/Dongdaemun.jpg",
    "shopping/Namdaemun Market.jpg",
    "shopping/Itaewon.jpg",
    "shopping/Insadong.jpg",
    "shopping/Edae Market.jpg",
    "shopping/Garuso-gil.jpg",
    "shopping/Apgujeong",
  ];
  final List nameThai = [
    'ย่านเมียงดง',
    'ตลาดทงแดมุน',
    'ตลาดนัมแดมุน',
    'ตลาดอิแทวอน',
    'ถนนอินซาดง',
    'ตลาดอีแด',
    'ถนนการูโซกิล',
    'ย่านอัพกูจอง',
  ];
  final List detail = [
    'เป็นจุดศูนย์รวมแฟชั่นที่สำคัญของวัยรุ่นเกาหลี ถ้าอยากรู้ว่าเทรนด์ไหนกำลังแรง กำลังดี ต้องมาเดินเฉิดฉายอัพเดทเทรนด์กันที่นี่ และนักช้อปปิ้งทั้งหลายจะไม่กลับบ้านมือเปล่าแน่นอน เพราะมีทั้งเสื้อผ้าอาภรณ์ รองเท้า เครื่องประดับ ผลิตภัณฑ์เสริมความงาม เครื่องสำอางค์จากทุกแบรนด์ ทุกยี่ห้อล่อตาล่อใจอยู่ในย่านนี้ ไม่มีเงินสดติดตัวก็ไม่ต้องกลัว เพราะแทบจะทุกร้านเค้าอนุมัติให้รูดปื๊ดผ่านบัตรเครดิตได้สบายหายห่วง ถ้าระหว่างเดินจับจ่ายใช้เงินอยู่แล้วเกิดหิวขึ้นมา ก็มีร้านค้า ร้านอาหารให้เลือกฝากท้องทุกมุมทั่วเมียงดง เรียกได้ว่าถ้าใครไปเกาหลีแค่เดินที่นี่ที่เดียวก็ได้ครบทุกอย่าง การเดินทาง : รถไฟใต้ดิน Line 4 Myeongdong stn.  Exit 5,6,7,8,9',
    'ใครที่มีเป้าหมายว่าไปเกาหลีคราวนี้ ฉันต้องเป็นเจ้าแม่แฟชั่นนำเทรนด์การแต่งกายสไตล์เกาหลีมาแต่งที่เมืองไทย ก็จงมุ่งหน้าไปให้ไวที่ตลาดแห่งนี้ เพราะเป็นศูนย์รวมเสื้อผ้าแฟชั่นทั้งผู้หญิง ผู้ชาย ไม่จำกัดเพศและอายุ ยิ่งถ้ามีแรงมากก็เดินมันเสามารถเดินได้ตั้งแต่เช้ายันดึกดื่น เพราะร้านค้าบางร้านเปิดตลอด 24 ชั่วโมง ด้วยกลัวว่านักท่องเที่ยวบางคนจะมีเวลาช้อปปิ้งไม่เพียงพอ ส่วนราคาสินค้าก็มีตั้งแต่ราคาขายส่งและปลีก ถ้าไปเป็นหมู่คณะก็จงหนีบกันไว้ให้แน่น ๆ เพราะจะสามารถซื้อได้ในราคาถูกมาก นอกจากนี้การเยือนตลาดทงแดมุนยังทำให้เราได้สัมผัสกับวัฒนธรรมเล็ก ๆ น้อย ๆ ของเกาหลีด้วย เพราะตัวตลาดนั้นตั้งอยู่ทางทิศตะวันออกของประตูเมืองอันเก่าแก่ของเกาหลี ทำให้นักท่องเที่ยวฟินไปตาม ๆ กัน การเดินทาง : รถไฟใต้ดิน Line 4 Dongdaemun Stn. Exit 8   / Line 2 Dongdaemun History & Culture Park Stn. Exit 14',
    'ถ้าอยากจะสัมผัสกับวิถีชีวิตของคนเกาหลีจริง ๆ ต้องไม่ควรพลาดการเยือนตลาดนัมแดมุน ตลาดอันเก่าแก่ที่ก่อตั้งมาตั้งแต่สมัยราชวงศ์โชซอล อายุอานามก็ปาเข้าไป 600 ปีแล้ว นี่ถ้าเป็นมนุษย์ก็คงจะหนังเหี่ยวยานลงไปถึงตาตุ่มเลยทีเดียว แต่ด้วยความที่เป็นตลาดมันกลับคึกคักและมีชีวิตชีวาราวกับคนหนุ่มสาว ซึ่งยิ้มเริงร่าต้อนรับแขกผู้มาเยือนอย่างไม่รู้จักเหน็ดเหนื่อย คอยเสนอขายอาหารพื้นเมือง สินค้าท้องถิ่น และวิถีชีวิตชาวบ้านที่หลากหลายมีมากมายจนเลือกไม่ถูก แถมราคาก็เป็นกันเองจนแทบอยากจะเหมาทุกอย่างกลับมาเมืองไทย การเดินทางก็สะดวกสบาย สามารถเดินมาได้จากประตูเมืองนัมแดมุน เป็นเสน่ห์ของแดนกิมจิที่นักท่องเที่ยวอยากไปสัมผัส การเดินทาง : รถไฟใต้ดิน Line 4 Hoehyeon Stn. Exit 7. Walk 400 m.',
    'ถ้าติดใจกับไลฟ์สไตล์แบบถนนข้าวสารในเมืองไทย ก็ต้องไปกดไลค์ให้กับตลาดแห่งนี้กันสักที เพราะเป็นแหล่งรวมสถานบันเทิง ร้านอาหาร คลับ ผับ บาร์ มากกว่า 2,000 ร้านค้า และร้านค้าแผงลอยตามทางเท้าอีกกว่า 400 แผง ซึ่งขายสินค้าพื้นเมือง ของที่ระลึก ไปจนถึงงานศิลปะ ถือว่าเป็นย่านที่น่าตื่นเต้นสำหรับคนกลางคืนและชาวต่างชาติ อีกทั้งยังเป็นแหล่งที่พักและโรงแรมยอดนิยมของนักท่องเที่ยวอีกด้วย การเดินทาง : รถไฟใต้ดิน Line 6 Itaewon Stn.',
    'อีกหนึ่งถนนที่จะทำให้คุณได้ของฝากที่น่ารัก ฟรุ้งฟริ้ง กระดิ่งแมวมาก ๆ เพราะเป็นถนนที่รวบรวมงานศิลปะแฮนด์เมดจากศิลปินชาวเกาหลีไว้มากมาย แม้ว่าจะเป็นถนนเส้นเล็ก ๆ แต่ก็เต็มเปี่ยมไปด้วยวัฒนธรรมของเกาหลี จึงเหมาะสำหรับคนที่หลงใหลงานศิลปะ ซึ่งนอกจากจะได้เลือกชมสินค้าจากร้านค้าแล้ว ก็ยังมีแกลลอรี่ให้ได้ชื่นชมความงดงามของศิลปะหลากหลายสาขา รวมทั้งการแสดงทางวัฒนธรรมบนลานการแสดงอีกด้วย การเดินทาง : รถไฟฟ้าใต้ดิน Line 3 Anguk Stn. Exit 6',
    'สำหรับสาว ๆ ทั้งหลายต้องไม่พลาดตลาดแห่งนี้ เพราะเป็นตลาดที่อยู่หน้ามหาวิทยาลัยอีฮวา (Ewha University) มหาวิทยาลัยสตรีชั้นนำของประเทศเกาหลี ทำให้มีร้านค้าที่ขายสินค้าเกี่ยวกับการแต่งตัวของผู้หญิงแบบครบวงจร ทั้งเสื้อผ้า กระเป๋า รองเท้า เครื่องสำอางค์ ผลิตภัณฑ์เสริมความงาม ฯลฯ ซึ่งสินค้าจะค่อนข้างอยู่ในเกรดเอ มีคุณภาพมากกว่าตลาดขายส่งทั่วไป จึงต้องจ่ายหนักกันสักนิดถ้าหากต้องการซื้อสินค้าในย่านนี้ แต่ก็ถือว่าคุ้มค่ากับคุณภาพของมัน การเดินทาง : รถไฟใต้ดิน Line 2 Ewha Womans Univ. Stn. Exit 2',
    'ถนนที่เต็มไปด้วยต้นไม้สองข้างทาง ซึ่งก็คือเจ้าต้นกิงโกะ (Ginkgo) หรือต้นแปะก๊วยนั่นเอง โดยมีความยาวของถนนประมาณ 700 เมตร (แต่แค่นี้ก็เดินเพลินได้ทั้งวันนะ) ถนนเส้นนี้อาจจะยังไม่ค่อยคุ้นหูมือใหม่หัดเที่ยวเกาหลีซักเท่าไหร่ แต่ขอบอกว่าหนุ่มสาวแดนโสมเขารู้จักกันเป็นอย่างดี เพราะเป็นถนนที่มีครบทุกรส ทั้งร้านเสื้อผ้า รองเท้า เครื่องประดับ ในแบบที่เรียกว่าฮิป ยูนิคสุดๆ ซึ่งส่วนใหญ่จะเป็นร้านของเหล่านักออกแบบที่มีชื่อเสียงและนักออกแบบอิสระรุ่นใหม่ของเกาหลีไปจนถึงสินค้าแบรนด์เนม การเดินทาง : รถไฟฟ้าใต้ดิน Line 3 Sinsa Stn. Exit 8',
    'อีกหนึ่งถนนแฟชั่นชื่อดังของกรุงโซล แหล่งรวมสินค้าแบรนด์เนมและสินค้าคุณภาพจากเหล่าดีไซเนอร์ชื่อดัง รวมทั้งอยู่ใกล้กับค่ายเพลงยักษ์ใหญ่ SM Entertainment โดยมีห้าง Galleria Department Store เป็นจุดศูนย์กลางในการพบปะนัดพบของแฟชั่นนิสต้าทั้งหลาย ซึ่งร้านค้าก็ไล่ไปตั้งแต่ระดับไฮโซม๊ากมาก ไปจนถึงระดับที่คนธรรมดาสามารถจับต้องได้ แต่ก็ต้องบอกว่าของเขาดีจริง คุ้มค่ากับเงินที่ต้องหลุดออกจากกระเป๋า เพราะทั้งดีไซน์และคุณภาพมันเก๋ไก๋ไม่เหมือนใคร ไม่แน่ระหว่างที่คุณเดินช้อปปิ้งอยู่นั้น อาจจะพบรักกับศิลปินเกาหลีที่นี่ก็เป็นได้ การเดินทาง : รถไฟฟ้าใต้ดิน Line 3 Apgujeong Stn. 20 min. walk from Exit 3. Bundang Line Apgujeong Rodeo Stn. 10 min. walk from Exit 5, 6.',
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("แหล่งช้อปปิ้ง"),
      ),
      body: Center(
        child: GridView.builder(
          primary: false,
          padding: const EdgeInsets.all(20),
          itemCount: myImageData.length,
          // gridDelegate: new SliverGridDelegateWithFixedCrossAxisCount(crossAxisCount: (orientation == Orientation.portrait) ? 2 : 3),
          gridDelegate:
              new SliverGridDelegateWithFixedCrossAxisCount(crossAxisCount: 2),
          itemBuilder: (BuildContext context, int index) {
            return Column(
              children: <Widget>[
                GestureDetector(
                  child: Hero(
                    tag: myImageData[index],
                    child: Image.asset(
                      'assets/images/' + myImageData[index],
                      height: 100,
                      width: 100,
                    ),
                  ),
                  onTap: () {
                    Navigator.push(
                      context,
                      MaterialPageRoute(builder: (_) {
                        return DetailScreen(
                            myImageData[index], nameThai[index], detail[index]);
                      }),
                    );
                  },
                ),
                Text(nameThai[index]),
              ],
            );
          },
        ),
      ),
    );
  }
}


class Cafe extends StatelessWidget {
  final List myImageData = [
    "cafe/BNHR Coffee.jpg",
    "cafe/Four Basic.jpg",
    "cafe/Pink Pool Cafe.jpg",
    "cafe/CETU.jpg",
    "cafe/Good night & Good luck cafe.jpg",
    "cafe/C.Through.jpg",
    "cafe/Cafe Mula.jpg",
    "cafe/Cafe Mind.jpg",
    "cafe/Café Layered.jpg",
    "cafe/Zapangi.jpg",
    "cafe/Café Skon.jpg",
    "cafe/LUFT Coffee.jpg",
    "cafe/C27 cheesecake & coffee.jpg",
    "cafe/Dore Dore.jpg",
    "cafe/BVBB Croissant Shop.jpg",
  ];
  final List nameThai = [
    'BNHR Coffee',
    'Four Basic',
    'Pink Pool Cafe',
    'CETU',
    'Good night & Good luck cafe',
    'C.Through',
    'Cafe Mula',
    'Cafe Mind',
    'Café Layered',
    'Zapangi',
    'Café Skon',
    'LUFT Coffee',
    'C27 cheesecake & coffee',
    'Dore Dore',
    'BVBB Croissant Shop',

  ];
  final List detail = [
    'ร้าน BNHR Coffee ซึ่งเป็นร้านที่ถูกตกแต่งออกมาในสไตล์เก๋ๆ ที่มีมุมให้เลือกถ่ายรูปได้หลากหลายจุด แถมยังมีเมนูยอดฮิตที่ไม่ว่าใครก็ต้องสั่งนั่นก็คือ  BNHR Coffee Latte และเค้กทิรามิสุ ที่บอกเลยว่าเนื้อเค้กนุ่มละมุน หอมกลิ่นกาแฟ ละมุนไปกับความหวานหอมของครีมที่ละลายในปาก รับรองได้เลยว่าใครได้ลิ้มลองแล้วละก็ต้องติดใจอย่างแน่นอน เรียกได้ว่าคาเฟ่นี้นอกจากจะมีมุมถ่ายรูปสวยๆแล้วนั้น ยังมีขนมและกาแฟที่อร่อยกลมกล่อมอีกด้วย การเดินทาง : ลงสถานีรถไฟฟ้าใต้ดิน Noksapyeong ทางออก 1',
    'เป็นร้านคาเฟ่ที่ตกแต่งออกมาให้ได้บรรยากาศแบบเกาหลีดั้งเดิมที่ผสมผสานกับความทันสมัยได้อย่างลงตัว ภายในร้านมีพื้นที่ไม่มากนัก แต่เต็มไปด้วยความอบอุ่นและความใส่ใจจากเจ้าของร้านและพนักงาน ซึ่งส่วนใหญ่แล้วร้านนี้จะเต็มไปด้วยหนุ่มสาวชาวเกาหลีและนักท่องเที่ยวชาวต่างชาติที่ชื่นชอบการดื่มด่ำรสชาติของกาแฟและของหวาน โดยเมนูเด็ดของที่นี่นั่นก็คือ เบเกิ้ล ที่ต้องบอกเลยว่ามาแล้วไม่ควรพลาดที่จะมาลองชิมรสชาติดูเนื่องจากเป็นเมนูยอดฮิตของทางร้าน การเดินทาง : ลงรถไฟฟ้าใต้ดินสถานี Hapjeong (622) สายสีส้ม',
    'สำหรับใครที่ชื่นชอบคาเฟ่แนวแปลกใหม่แล้วละก็ สามารถมาได้ที่ Pink Pool Cafe ซึ่งตั้งอยู่ในตึก STYLENANDA ย่านเมียงดงที่เป็นแหล่งช้อปปิ้งย่านดังของเกาหลี หากใครที่เดินทางมาช้อปปิ้งและอยากมาแวะหาหาน้ำดื่มจิบเบาๆ แถมยังได้ถ่ายรูปสวยๆก็มาได้ที่นี่เลย เพราะภายในร้านแห่งนี้ได้ถูกตกแต่งออกมาในรูปแบบของสระว่ายน้ำโทนสีฟ้าและชมพูที่เก๋ไก๋ สามารถถ่ายรูปได้ทุกจุด แถมยังมีชั้นดาดฟ้าที่เปิดให้ลูกค้าสามารถขึ้นมาถ่ายรูปได้อย่างอิ่มหนำสำราญ หากใครที่แวะมาที่ย่านนี้แล้วละก็ไม่ควรพลาดเลยที่นี่ การเดินทาง : รถไฟใต้ดินลงสถานี Myeongdong Station สาย 4 สีฟ้า แล้วออกทางออกที่ 6 เดินตรงไปแยกที่ 2 เลี้ยวมาทางขวา',
    'คาเฟ่ที่มองดูภายนอกแล้วดูลึกลับ แต่เมื่อเดินเข้ามาถึงภายในต้องบอกเลยว่าน่ารักมากๆ เพราะคาเฟ่แห่งนี้ถูกตกแต่งออกมาในสไตล์เรียบง่าย แต่รังสรรค์เมนูทุกเมนูในร้านให้น่ารักชวนหลงใหล เหมาะแก่การมาถ่ายรูปเป็นอย่างมาก ซึ่งส่วนใหญ่ภายในคาเฟ่แห่งนี้จะเต็มไปด้วยวัยรุ่นชาวเกาหลีซะส่วนใหญ่ เพราะเป็นร้านเล็กๆที่นักท่องเที่ยวยังไม่รู้จักกันมากนัก หากใครที่จะเดินทางมาอาจจะรู้สึกว่าร้านดูลึกลับซับซ้อน แต่เมื่อเดินขึ้นมาก็จะรู้ได้เลยว่ามาถึงร้านแล้วรับรองว่าไม่ผิดหวังอย่างแน่นอน การเดินทาง : ลงสถานี Euljiro 3 (sam) ga (203) ทางออก 3',
    'สำหรับใครที่ชื่นชอบชีสเค้กแล้วละก็ไม่ควรพลาดกับร้านนี้เลย ร้าน Good night & Good luck cafe ซึ่งเป็นร้านชีสเค้กนิยมของคนเกาหลี เนื่องจากที่ร้านแห่งนี้มีเค้กให้เลือกหลากหลายชนิดด้วยกัน แถมภายในร้านยังถูกตกแต่งออกมาได้อย่างสวยงาม และยังใส่ใจในขนมทุกชิ้นอีกด้วย หากใครที่เดินทางมาและอยากลิ้มลองรสชาติของชีสเค้กที่นุ่มละมุนแบบนี้แล้วละก็ สามารถมาได้ที่ร้านนี้เลย เพราะนอกจากจะมีมุมถ่ายรูปสวยๆแล้ว รสชาติของขนมทุกชิ้นยังฟินสุดๆอีกด้วย การเดินทาง : ลงรถไฟใต้ดินสาย 3 สีส้ม ลงสถานีอัพกูจอง (Apgujeong) ทางออกที่ 5',
    'หากใครที่ชอบเสพงานศิลปะแล้วละก็ สามารถมาได้เลยที่ ร้าน C.Through ซึ่งเป็นร้านกาแฟชื่อดังของเกาหลี ที่โดดเด่นในเรื่องของการสร้างสรรค์เมนูครีมอาร์ตในสไตล์ของศิลปะแวนโก๊ะ ที่สวยงาม โดยบาริสต้าของทางร้านที่มีความเชี่ยวชาญในเรื่องของศิลปะ นอกจากนี้ในเรื่องของการตกแต่งภายในร้านก็ถือว่าสวยงามเป็นอย่างมาก โดยภายในร้านมีการตกแต่งออกมาอย่างเรียบง่ายเน้นโทนสีขาวที่ทำให้ภายในร้านดูสะอาดตา ในสไตล์มินิมอลที่ถูกใจเหล่าบรรดานักท่องเที่ยวและหนุ่มสาวชาวเกาหลีเป็นอย่างมาก การเดินทาง :ลงสถานี Noksapyeong ทางออกที่ 3',
    'ใครเป็นสายมินิมอลห้ามพลาดกับร้านนี้เลย ร้าน Cafe Mula ที่ตั้งอยู่บริเวณย่านกังนัม โดยภายในร้านแห่งนี้ได้ถูกตกแต่งออกมาในสไตล์มินิมอลที่เรียบหรู และยังมีด้วยกันทั้งหมด 2 ชั้น ซึ่งจะมีบริเวณดาดฟ้าที่เปิดให้ลูกค้าสามารถมานั่งรับลมชมวิวและถ่ายรูปได้อย่างเต็มที่ นอกจากนี้ยังมีขนมเค้กและกาแฟที่สามารถสั่งมานั่งดื่มชิวๆชมบรรยากาศภายในร้านและถ่ายรูปเล่นได้ตามใจชอบ หากใครที่ชื่นชอบสไตล์นี้แล้วละก็ไม่ควรพลาดเลยที่นี่ การเดินทาง : ลงสถานี Sinsa ทางออก 8',
    'เอาใจสายติส กันที่ร้าน Cafe Mind เป็นร้านคาเฟ่ที่ตกแต่งโดยเน้นโทนสีขาว เรียบง่าย และคงคอนเซ็ปความเป็นมินิมอล ตั้งแต่การตกแต่งภายในร้าน ไปจนถึงเมนูอาหารที่ดึงดูดให้เหล่าสายแฟชั่นและสายติสเดินทางมาเพื่อถ่ายรูป และนั่งดื่มด่ำกับรสชาติของกาแฟและขนมที่ถือว่ามีดีไม่แพ้กับบรรยากาศภายในร้านเลย ซึ่งหากใครที่เดินทางมาถึงที่ร้านแห่งนี้แล้วละก็ลองสั่งเมนู ครีมคาปูชิโน่ มาลองทานได้เลย เพราะเค้าบอกว่าเมนูนี้เป็นเมนูแนะนำที่หวานหอมมันแบบฟินสุดๆเลยทีเดียว การเดินทาง : ลงสถานีKonkuk University ทางออกที่ 6',
    'เป็นร้านคาเฟ่ในสไตล์ฝรั่งเศส ที่มีความคลาสิคเป็นอย่างมาก ภายในถูกตกแต่งออกมาด้วยโทนสีเหลืองอ่อน ผสมผสานกับสีขาวและสีดำอย่างลงตัว แถมยังมีกระจกใสที่สามารถมองเห็นขนมที่น่าทานมากมายเรียงรายอยู่ภายในร้าน ทำให้ผู้คนที่เดินผ่านต่างพากันให้ความสนใจและอยากจะเข้ามาลิ้มลองรสชาติของขนมภายในร้าน ซึ่งขนมที่ขายดีของร้านนี้นั่นก็คือ Cream Scone และ Cheddar Cheese Bacon Scone เนื่องจากเป็นเมนูแปลกใหม่ ทำให้คนให้ความสนใจเป็นอย่างมาก แถมยังมีรสชาติอร่อยอีกด้วย การเดินทาง : ลงรถไฟฟ้าใต้ดิน Ankug (328) ทางออก 2',
    'อีกหนึ่งคาเฟ่ยอดนิยมที่เต็มไปด้วยเหล่าบรรดานักท่องเที่ยวมากมายที่ให้ความสนใจกับตู้กดสีชมพูที่โดดเด่น ของร้าน Zapangi ซึ่งเป็นร้านที่มีดีไซน์ในการตกแต่ง โดยเน้นโทนสีชมพูเป็นหลัก จึงทำให้เกิดออกมาเป็นร้านที่มีความสวยงามและน่าดึงดูด ทำให้นักท่องเที่ยวส่วนใหญ่นิยมเดินทางมาเพื่อถ่ายรูปบริเวณหน้าร้านที่มีประตูเป็นตู้กดน้ำสีชมพูที่สวยงาม และกลายเป็นอีกหนึ่งโลเคชั่นที่ไม่ว่าใครที่เดินทางมาเที่ยวเกาหลีแห่งนี้ก็ต้องแวะมาแชะภาพกันที่นี่เลย การเดินทาง : ลงรถไฟฟ้าใต้ดิน Mangwon station ทางออก 2 เดินเข้าถนน World cup-ro 13-gil',
    'เป็นอีกหนึ่งร้านที่ถูกใจเหล่าบรรดาหนุ่มสาวเกาหลี รวมไปถึงนักท่องเที่ยวเป็นอย่างมาก เนื่องจากการตกแต่งภายในร้านที่สวยงาม เน้นโทนสีขาว และสีครีมอ่อน ที่ทำให้ภายในร้านดูกว้างขวางและสะอาดตา เหมาะกับคนที่ชอบถ่ายรูปสีคลีนๆ เรียกได้ว่า สามารถมาถ่ายได้ทุกมุมของร้านเลยก็ว่าได้ นอกจากนี้ทางร้านยังมีเมนูพิเศษอย่าง Lemon Cake ซึ่งเป็นเมนูแนะนำของทางร้านหากใครที่เดินทางมาก็สามารถมารับประทานควบคู่ไปกับการแฟและนั่งถ่ายรูปกันอย่างชิวๆได้เลย การเดินทาง : ลงรถไฟฟ้าใต้ดินสถานี Hongik (239) ทางออก 3',
    'เป็นอีกหนึ่งร้านคาเฟ่ที่มีการตกแต่งในสไตล์เรียบง่ายมีการนำต้นไม้เข้ามาประดับตกแต่งเพื่อเกิดเป็นสีสันแบบธรรมชาติที่สวยงาม เหมาะแก่การมานั่งดื่มด่ำกับการจิบกาแฟชิวๆรับชมบรรยากาศรอบนอกที่คึกครื้น เนื่องจากร้านคาเฟ่แห่งนี้ตั้งอยู่บริเวณย่านเมียงดงที่เต็มไปด้วยเหล่านักท่องเที่ยวมากมายที่มาช้อปปิ้งเป็นจำนวนมาก และหลายคนอาจจะไม่รู้ว่ามีร้านคาเฟ่สวยๆในสไตล์มินิมอลอยู่ที่ย่านนี้ด้วย หากใครที่มาเที่ยวย่านเมียงดงนี้แล้วละก็สามารถมาแวะถ่ายรูปสวยๆได้ที่ร้านนี้เลย การเดินทาง : ลงรถไฟฟ้าใต้ดิน Ankug (328) ทางออก 2',
    'อีกหนึ่งร้านที่ขึ้นชื่อในเรื่องของชีสเค้กอย่างร้าน C27 cheesecake & coffee ซึ่งเป็นร้านที่มีชีสเค้กให้เลือกหลากหลายชาติด้วยกัน โดยการตกแต่งภายในร้านก็เหมาะสำหรับการมาถ่ายรูปชิคๆเป็นอย่างมาก เนื่องจากมีการตกแต่งในสไตล์ลอฟ์ทที่ดึงดูดความสนใจจากเหล่านักท่องเที่ยวที่เดินทางมาเป็นอย่างมาก ทำให้ร้านแห่งนี้เต็มไปด้วยลูกค้าเนื่องแน่นตลอดทั้งวัน เพื่อมาซื้อชีสเค้กที่หอนกรุ่นนุ่มละมุน และมานั่งถ่ายรูปชิคๆกันที่ร้านได้อย่างสนุกสนาน หากใครที่ชื่นชอบสไตล์สอฟ์ทและชีสเค้กอร่อยๆแล้วละก็มาได้เลยที่นี่ การเดินทาง : ลงรถไฟฟ้าใต้ดิน Sinsa ทางออก 8',
    'หากใครที่เคยดูรายการสามแฝดแล้วละก็ ต้องเคยเห็นร้านนี้อย่างแน่นอนนั่นก็คือร้าน Dore Dore ซึ่งเป็นร้านที่มีการครีเอทรูปแบบของเค้กที่ดึงดูดสายตาเหล่าลูกค้าได้อย่างมาก เนื่องจากมีขนาดที่ใหญ่กว่าเค้กทั่วไป รวมไปถึงรสชาติที่บอกเลยว่าอร่อยมากๆ หากใครที่อยากตามรอยสามแฝดมาลิ้มลองรสชาติเค้กที่ร้านนี้แล้วละก็ มาได้เลยที่ร้านนี้ เพราะนอกจากจะมีรสชาติที่อร่อยแล้ว ยังมีมุมถ่ายรูปสุดชิคที่รับรองได้เลยว่าได้รูปสวยๆทุกมุมแน่นอน การเดินทาง : ลงรถไฟฟ้าใต้ดิน Ankug (328) ทางออก 2',
    'สายเอิร์ธ โทน ไม่ควรพลาดที่คาเฟ่นี่เลย BVBB Croissant Shop คาเฟ่ที่ตกแต่งออกมาด้วยโทนสีน้ำตาล และสีครีม ซึ่งมีด้วยกันทั้งหมดสองชั้น แถมยังมีบริเวณที่นั่งกลางแจ้งที่นักท่องเที่ยวสามารถมาถ่ายรูปได้ตามอัธยาศัย โดยจุดเด่นของที่ร้านแห่งนี้นั่นก็คือ ครัวซองต์ที่ออกจากเตาใหม่ๆแบบยังร้อนกรุ่นกันเลยทีเดียว หากใครมาแล้วก็พลลาดไม่ได้เลยกับครัวซองต์ยอดฮิตของที่นี่นั่นก็คือ ไส้ชีสและถั่วแดงกวน ที่หมดเร็วกว่าใครเพื่อน และนอกจากสองรสชาติยอดนิยมนี้แล้ว ก็ยังมีอีกหลายรสชาติอีกมากมายที่นักท่องเที่ยวสามารถเลือกชิมได้อย่างเต็มที่อีกด้วย การเดินทาง : ลงรถไฟฟ้าใต้ดินสถานี Hapjeong (622) สายสีส้ม',
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("แหล่งช้อปปิ้ง"),
      ),
      body: Center(
        child: GridView.builder(
          primary: false,
          padding: const EdgeInsets.all(20),
          itemCount: myImageData.length,
          // gridDelegate: new SliverGridDelegateWithFixedCrossAxisCount(crossAxisCount: (orientation == Orientation.portrait) ? 2 : 3),
          gridDelegate:
              new SliverGridDelegateWithFixedCrossAxisCount(crossAxisCount: 2),
          itemBuilder: (BuildContext context, int index) {
            return Column(
              children: <Widget>[
                GestureDetector(
                  child: Hero(
                    tag: myImageData[index],
                    child: Image.asset(
                      'assets/images/' + myImageData[index],
                      height: 100,
                      width: 100,
                    ),
                  ),
                  onTap: () {
                    Navigator.push(
                      context,
                      MaterialPageRoute(builder: (_) {
                        return DetailScreen(
                            myImageData[index], nameThai[index], detail[index]);
                      }),
                    );
                  },
                ),
                Text(nameThai[index]),
              ],
            );
          },
        ),
      ),
    );
  }
}



class DetailScreen extends StatelessWidget {
  final imageSrc, nameThai ,detail;
  DetailScreen(this.imageSrc, this.nameThai ,this.detail);
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('Back'),
        ),
        body: Column(
        children: <Widget>[
          GestureDetector(
            child: Hero(
              tag: imageSrc,
              child: Image.asset(
                'assets/images/' + imageSrc,
              ),
            ),
            onTap: () {
              Navigator.pop(context);
            },
          ),
          Text(nameThai),
          Text(detail),
        ],
      ),
    );
  }
}
